// let events = [
//   maidan = [
//     _1 = {
//       theme: '1. Что понимается под словом «Майдан»?',
//       text: [
//         'Майдан – украинское слово, переводящееся на русский как «Площадь». В контексте происходящих событий, начавшихся в Украине в ноябре 2013 года, имеются в виду митинги (на территории всей страны, во всех крупных городах) против изменения направления развития страны. Альтернативное название – Евромайдан или Революция достоинства.',
//         'Согласно Конституции Украины (статья 39) граждане имеют право на мирные собрания.',
//         'Согласно Конституции Украины (статья 5) народ осуществляет власть непосредственно и через органы государственной власти, органы местного самоуправления. В международном праве возможность на мирные собрания закреплена в «Всеобщая декларация прав человека» в статье 20, а также в третьем абзаце преамбулы.'
//       ]
//     },
//     _2 = {
//       theme: '2. Причины',
//       text: [
//         '21 ноября 2013 года, за несколько дней до саммита Восточного партнёрства в Вильнюсе, намеченного на 28-29 ноября 2013, основным событием которого должно было стать подписание Украиной соглашения об ассоциации с Европейским союзом, правительство Украины заявило о приостановлении подготовки к заключению этого соглашения. Распоряжение об этом было официально обнародовано премьер-министром Украины Николаем Азаровым.'
//       ]
//     },
//     _3 = {
//       theme: '3. Начало «Майдана»',
//       text: [
//         'Сразу же после обнародования решения правительства приостановить процесс подготовки к подписанию соглашения об ассоциации Украины с ЕС Партия УДАР Виталия Кличко заявила о намерении обратиться в Генеральную прокуратуру о возбуждении уголовного дела против премьер- министра Азарова в связи с нарушением закона «Об основах внешней и внутренней политики Украины» и превышением служебных полномочий, и призвала всех украинцев, не равнодушных к своему будущему, выйти 24 ноября на митинг оппозиции и продемонстрировать власти «действительную волю людей, которую она обязана исполнять».',
//         'Однако уже вечером 21 ноября в социальных сетях начали распространяться призывы немедленно выйти на акцию протеста. Первая акция началась на Майдане Незалежности в Киеве примерно в 22:00. На митинг собралось от 1 до 2 тысяч человек. Пришли журналисты, общественные активисты, оппозиционные политические лидеры.',
//         'По словам наблюдателей, собравшимися на площади двигали два основных мотива:',
//         '1. Многие искренне считали, что Соглашение об ассоциации открывало двери Украине в ЕС. На протяжении предшествовавшего года это представление поддерживали не только представители парламентской оппозиции, но и Партия регионов, заявлявшая о европейском выборе и европейском пути;',
//         '2. Антироссийский по своей сути протест против возможного присоединения к Таможенному союзу. В ряде регионов участники Евромайданов выдвигали не только проевропейские лозунги, но и требовали отставки местных властей.'
//       ]
//     },
//     _4 = {
//       theme: '4. Происходящее',
//       text: [
//         'В данном пункте будет описано только то, с чего всё началось. Это связано с тем, что Майдан прямо не связан с войной РФ против Украины, а является лишь предлогом. Больше можно прочитать здесь. По версии следствия, которое проводила Генеральная прокуратура Украины, 30 ноября в 4 часа утра милиция потребовала освободить Майдан для того, чтобы подготовить его к празднованию Нового года. Участники протестов, находившиеся на площади, проигнорировали это требование, часть из них стала проявлять агрессию, которая переросла в столкновение с милицией.',
//         'Спецоперация, в которой было задействовано, по свидетельствам очевидцев, около 2000 бойцов «Беркута», переброшенных в Киев из различных регионов Украины, началась в 4 утра. По словам очевидцев, на площади в это время находилось около тысячи участников Евромайдана. Большинство из них подчинились требованиям покинуть площадь и вышли по коридорам, которые были им предоставлены, но около двухсот человек остались на месте. Командир «Беркута» Сергей Кусюк заявил, что собравшиеся вели себя агрессивно, не реагировали на призывы освободить площадь и закидывали бойцов «Беркута» бутылками, палками и стеклом. По версии очевидцев и журналистов, на площади в этот момент находились в основном молодые люди, студенты вузов, по версии властей – провокаторы. В ходе силовой акции избиению сотрудниками «Беркута» подвергались даже девушки. Бойцы «Беркута» преследовали людей по Крещатику и прилегающим улицам вплоть до Михайловского собора, монахи которого открыли ворота и укрыли до двухсот митингующих.',
//         'В ходе силовой акции 79 человек получили телесные повреждения, в том числе 7 милиционеров. Из них, по официальным данным, 21 человек был доставлен в больницу, 10 было госпитализировано. Разгон палаточного городка привёл к немедленному изменению политической ситуации. Жёсткая силовая акция вызвала массовое сопереживание пострадавшим, предоставив оппозиции сильнейший аргумент против власти. Данное событие было первым в череде последующих ужасных происшествий, произошедших на Майдане.',
//         '18 декабря 2013 года приказы о разгоне митинга привели к первым жертвам. Так, вечером этого дня, когда Мазуренко Павел Анатолиевич шел домой, на улице Гната Юры на Борщаговке в Киеве возле торгового центра «Квадрат» его остановили спецназовцы в черной форме и бронежилетах для проверки документов. Павел показал им ксерокопию паспорта с крымской пропиской в нем. Милиционеры решили, что он участник Евромайдана и жестоко избили его палками и ногами, после чего ушли, оставив лежащего Павла на земле. Мужчине удалось подняться и самостоятельно добраться домой, где он и рассказал жене и друзьям, что с ним случилось.',
//         'Сначала мужчина отказался от госпитализации. Но через 2 дня состояние резко ухудшилось и он был доставлен в реанимационное отделение Киевской городской клинической больницы No 12. Врачи диагностировали ушибы и травму головы. Умер Павел Мазуренко 22 декабря 2013 года в том же реанимационном отделении.',
//         'В ходе всего Евромайдана, во время выполнения приказов о разгоне митингующих было убито 107 человек, которых в последствии будут называть Небесная сотня. Данные приказы о разгоне митингующих с использованием оружия, специальных средств и техники являются фактором уголовного дела Януковича В.Ф. На данный момент расследование продолжается.',
//         'На исполнителей преступных приказов также открыты уголовные дела. Часть бойцов «Беркута» уехала из Украины и устроилась на работу в силовые структуры России и Беларуси. В ходе уголовного дела Украина запрашивала у России экстрадицию бывшего руководителя киевского «Беркута» Сергея Кусюка, однако получила отказала.',
//         '21 февраля 2014 года Верховная Рада приняла закон 4073 - 1 «Закон о недопущении преследования и наказания лиц по поводу событий, которые имели место во время проведения мирных собраний , и признания утратившими силу некоторых законов Украины», а также Постановление «Постановление об осуждении применения насилия, что привело к гибели мирных граждан Украины». В пояснительной записке к данному постановлению говорится о том, что 21 ноября 2013 года в Украине начались мирные акции протеста. В ночь с 29 на 30 декабря 2013 года мирные демонстранты были жестоко избиты работниками спецподразделения «Беркут». Такие незаконные действия повлекли за собой массовое мирное сопротивление народа во всех уголках Украины, основной целью которого стала защита права на собственное достоинство, права на мирные собрания, а также других фундаментальных прав человека.'
//       ]
//     }
//   ],
//   maidan_end = [],
//   crymea = [
//     _1 = {
//       theme: '1. Войска России на территории Крыма',
//       text: [
//         '28 мая 1997 года между Украиной и РФ было подписано «Соглашение о статусе и условиях пребывания Черноморского флота Российской Федерации на территории Украины».',
//         'В 2010 году данное соглашение было продлено (документ 1, документ 2) на 20 лет (статья 25), с автоматическим продлением еще на 5 лет.',
//         'В договоре прописано количество и места дислокации войск.',
//         'В пункте 5, статьи 15 говорится следующее: «Передвижения, связанные с деятельностью военных формирований вне мест их дислокации, осуществляются после согласования с компетентными органами Украины».',
//         'После аннексии Крыма, Российская Федерация в одностороннем порядке разорвала свои обязательства в отношении Украины о выполнения данного соглашения.'
//       ]
//     },
//     _2 = {
//       theme: '2. Захват',
//       text: [
//         'В ночь с 26 на 27 февраля российские войска, покинув места дислокации, начали захват административных зданий. Были захвачены здания Верховного Совета и Совета министров АР Крым в Симферополе; кроме того, ранним утром были установлены блокпосты на Перекопском перешейке и Чонгарском полуострове, что перерезало сухопутное сообщение Крыма с материковой Украиной.',
//         'Своими действиями РФ совершила акт Агрессии по отношению к Украине согласно уставу ООН (статья 3, пункт Е). Отдельно нужно отметить нарушение Россией Декларации о недопустимости интервенции и вмешательства во внутренние дела государств, а также Декларации о недопустимости вмешательства во внутренние дела государств, об ограждении их независимости и суверенитета.',
//         'На пресс-конференции в Москве 19 декабря 2013 года Путин В.В. отрицал возможность ввода российских войск для «защиты соотечественников».',
//         'После 27 февраля факт участия российских войск в присоединении Крыма отрицался и лишь спустя несколько недель был признан российским руководством.',
//         'Президент Российской Федерации дал интервью телеканалу «Россия 1», в котором признал своё участие в захвате Крыма, а также говорил абсолютно противоположное в сравнении с пресс- конференцией от 19 декабря 2013 года. Главным тезисом данного интервью было то, что возникла необходимость защитить русских, а также дать им возможность вольного выражения своего мнения по поводу перехода территории от Украины к Российской Федерации. Однако в том же видео видно, как происходит захват зданий, на которых сразу же вывешиваются флаги Российской Федерации и снимают флаги Украины еще до того, как «люди выразили своё мнение».',
//         'Отдельно необходимо осветить момент с медалью «За возвращение Крыма». Данная медаль была Учреждена 21 марта 2014 года приказом Министра обороны РФ, однако же на реверсе медали стоят следующие даты: 20.02.2014 – 18.03.2014. Дата 18.03.2014 – это дата подписания договора, на основании проведённого «референдума», образовавшего на этой территории субъект Российской Федерации. Дата 20.02.2014 является косвенным подтверждением того, что аннексия Крыма готовилась заранее и еще до момента «самоустранения» Януковича В.Ф.',
//         'Важным фактором «спокойного» захвата Крыма стало то, что якобы не было боевых действий за эту территорию, а жители Крыма хотели в Российскую Федерацию. Оба эти утверждения являются ложными. В ходе захвата были убийства, а также, на примере видео по захвату Феодосии явно видны боевые действия:',
//         'Второе утверждение по поводу того, что жители АР Крым хотели в Российскую Федерацию, разобрано в разделе «Мифы пропаганды».',
//         'Согласно оценке Миссии ОБСЕ (пункты 120, 121, 122) в процессе захвата власти на территории АР Крым были неоднократные нарушения прав и свобод, а также жестокое обращение, направленное против активных сторонников Украины.',
//         'Действия Верховной Рады Украины с 28 февраля 2014 года после начала аннексии Российской Федерацией АР Крым приведены в таблице:'
//       ]
//     },
//     _3 = {
//       theme: '3. Новая власть',
//       text: [
//         'С 8 ноября 2011 по 27 февраля 2014 Председателем Совета министров АР Крым был Могилёв Анатолий Владимирович.',
//         '27 февраля 2014 года премьер Могилев А.В. и весь Совет Министров АР Крым, с нарушением действующего законодательства, был отправлен в отставку Парламентом Крыма под влиянием военных РФ, захвативших здание Верховной РадыАР Крым. Совет Министров был незаконно заменен самопровозглашенным премьер-министром АР Крым Сергеем Валерьевичем Аксеновым.',
//         'Согласно Конституции АР Крым (статья 37) Председатель Совета министров АР Крым назначается на должность и освобождается от неё Верховным Советом АР Крым по согласованию с Президентом Украины.',
//         '27 февраля во взятом российскими силами здании Верховного Совета АР Крым была проведена чрезвычайная сессия парламента АР Крым, на которой лидер партии «Русское единство» Сергей Валерьевич Аксёнов был назначен на пост председателя правительства региона. Данное решение не было признано центральными украинскими властями. Президент Украины не утвердил данное назначение, о чём говорит соответствующий указ.',
//         'Отдельно необходимо отметить следующее: согласно Конституции Украины (статья 106, пункт 16) Президент Украины имеет полномочия упразднять акты Совета министров АР Крым.',
//         'В дальнейшем военный преступник Стрелков Игорь Иванович в интервью подтвердит своё участие в захвате власти в Крыму.',
//         '1 марта 2014 года, в попытке легитимизировать ввод войск РФ на территорию Крыма, Аксёнов С.В. попросил Путина В.В. о вводе войск на территорию Крыма, хотя войска там уже находились с 27 февраля.'
//       ]
//     }
//   ]
// ]

// const nav = document.querySelector('.nav')

// let eventsArray = []

// for (i = 0; i < nav.children.length; i++) {
//   eventsArray.push(nav.children[i])
// }

// function addLinks() {
//   let origin = events[0]
//   for (i = 0; i < origin.length; i++) {
//     for (j = 0; j < origin[i].text.length; j++) {
//       const par = origin[i].text[j].split(' ')
//       const parEl = document.createElement('div')
//       parEl.classList.add('par')
//       document.querySelector('.block').appendChild(parEl)
//       for (k = 0; k < par.length; k++) {
//         const el = document.createElement('div')
//         const elText = document.createTextNode(par[k])
//         // if (par[k] == ) {
//         //   console.log('a')
//         // }
//         for (p = 0; p < links[0].length; p++) {
//           let words = links[0][p].split(' ')
//           // console.log(words)

//           for (o = 0; o < words.length; o++) {
//             if (words[o] == par[k]) {
//               el.classList.add('link')
//               delete links[0][p]
//             } 
//             console.log(words[o], par[k])
//           }
//           // if (par[k] == links[0][p]) {
//           // }
//         }
//         el.appendChild(elText)
//         parEl.appendChild(el)
//       }
//     }
//   }
// }
// function addLinks(event) {
//   for (i = 0; i < event.length; i++) {
//     for (j = 0; j < event[i].text.length; j++) {
//       const par = event[i].text[j].split(' ')
//       console.log(par)
//     }
//   }
// }

// function showText(array, target) {
//   const parent = document.querySelector('.block')
//   const event = document.createElement('div')
//   event.classList.add('event-title')
//   const eventTitle = document.createTextNode(target.querySelector('.event').innerHTML)
//   event.appendChild(eventTitle)
//   parent.appendChild(event)

//   for (i = 0; i < array.length; i++) {
//     const newTheme = document.createElement('div')
//     newTheme.classList.add(`theme`)
//     parent.appendChild(newTheme)

//     const themeElement = document.createElement('div')
//     themeElement.classList.add('title')
//     const themeTitle = document.createTextNode(array[i].theme)
//     themeElement.appendChild(themeTitle)
//     newTheme.appendChild(themeElement)

//     for (j = 0; j < array[i].text.length; j++) {
//       // console.log(array[i].text[j])
//       const themeParElement = document.createElement('div')
//       const themePar = document.createTextNode(array[i].text[j])
//       themeParElement.classList.add('p')
//       themeParElement.appendChild(themePar)
//       newTheme.appendChild(themeParElement)
//     }
//   }
// }

// eventsArray.forEach((event, index) => {
//   event.onclick = () => {
//     // console.log(events[index])
//     // showText(events[index], event)
//     addLinks()
//   }
// })

////////////////////////
// const eventNav = document.querySelector('.event-nav'),
//       eventNavThemes = eventNav.querySelectorAll('.theme'),

//       themes = document.querySelectorAll('.event .theme'),
//       themePositions = []

// for (theme of themes) {
//   themePositions.push(theme.getBoundingClientRect().y - window.screen.height / 3 + scrollY)
// }

// eventNavThemes.forEach((theme, i) => {
//   theme.onclick = () => {
//     scrollTo(0, themePositions[i] + 20)
//     eventNavThemes.forEach(theme => {
//       theme.style.opacity = '.8'
//     })
//     index = i
//   }
// })





// let topNavEvents = document.querySelector('.nav').children,
//     topNavEventsArray = []

// for (i = 0; i < topNavEvents.length; i++) {
//   topNavEventsArray.push(topNavEvents[i])
// }

// topNavEventsArray.forEach(event => {
//   event.onmouseover = () => {
//     // let themes = document.querySelectorAll(`.ev`)

//     for (i = 0; i < document.querySelector('.nav').children.length; i++) {
//       document.querySelector('.nav').children[i].querySelector('.slide').style.display = 'none'
//       // event.querySelector('.slide').style.display = 'none'
//     }

//     // for (i = 0; i < document.querySelector('.nav').children.length; i++) {
//     //   console.log(document.querySelector('.nav').children[i])
//     // }

//     event.querySelector('.slide').style.width = `${getComputedStyle(event.querySelector('.date')).getPropertyValue('width')}`
//     // event.querySelector('.slide').style.height = '100%'
//     event.querySelector('.slide').style.display = 'block'
//     event.querySelector('.slide').style.marginTop = `${parseInt(getComputedStyle(event.parentElement).getPropertyValue('padding'))}px`

//     // console.log(event.querySelector(''))
//     // console.log(event.className)
//   }
//   event.querySelector('.slide').onmouseout = () => {
//     // event.querySelector('.slide').style.height = '0px'
//     event.querySelector('.slide').style.display = 'none'
//   }
// })



const leftNav = document.querySelector('.left-nav'),
      leftNavEvents = leftNav.querySelectorAll('.event'),

      infoEvents = document.querySelector('.info .event')

let themes = document.querySelectorAll('.info .active .theme'),
    eventNavThemes = leftNav.querySelectorAll('.event .active .theme'),

    themePositions = [],
    index = 0

function setThemesPositions() {
  eventNavThemes = leftNav.querySelectorAll('.event .active .theme'),
  index = 0
  themePositions = []
  themes = document.querySelectorAll('.info .event .theme')
  for (theme of themes) {
    themePositions.push(theme.getBoundingClientRect().y - window.screen.height / 5 + scrollY)
  }
}

setThemesPositions()

leftNavEvents.forEach(event => {
  event.querySelector('.title img').onclick = () => {
    document.querySelectorAll('.timeline .nav-top').forEach((infoEvent, i) => {
      leftNav.querySelectorAll('.themes')[i].classList.remove('active')
      leftNav.querySelectorAll('.title img')[i].classList.remove('hideThemes')
    })
    event.querySelector('.themes').classList.add('active')
    event.querySelector('.title img').classList.add('hideThemes')
  }
})

// function setLeftNav() {
//   scrollTo(0, 0)

//   infoEvents.forEach((infoEvent, i) => {
//     infoEvent.classList.remove('active')
//     leftNavEvents[i].style.order = '0'
//   })

//   infoEvents.forEach((infoEvent, i) => {
//     leftNav.querySelectorAll('.themes')[i].classList.remove('active')
//     leftNav.querySelectorAll('.title img')[i].classList.remove('hideThemes')
//     leftNav.querySelectorAll('.title .event-title')[i].style.opacity = '.7'
//   })
// }

const topNav = document.querySelector('.nav .timeline'), 
      topNavEvents = topNav.querySelectorAll('.nav-top')

topNavEvents.forEach((event, index) => {
  event.onmouseover = () => {
    event.querySelector('.event').style.opacity = '1'
  }
  event.onmouseout = () => {
    topNavEvents.forEach(event => {
      event.querySelector('.event').style.opacity = '.8'
    })
  }
})

// let eventNav = document.querySelector('.event-nav')

function clearOpacityLeftNav() {
  eventNavThemes.forEach(theme => {
    theme.style.opacity = '.6'
  })
}


// eventNavThemes.forEach((theme, i) => {
//   theme.onclick = () => {
//     scrollTo(0, themePositions[i] + 20)
//     clearOpacityLeftNav()
//     index = i
//   }
// })

const leftNavThemes = leftNav.querySelectorAll('.event .themes .theme')

leftNav.querySelectorAll('.event .active .theme').forEach((theme, i) => {
  theme.onclick = () => {
    setTimeout(() => {
      scrollTo({ left: 0, top: themePositions[i]})
      clearOpacityLeftNav()
      index = i
      theme.style.opacity = '1'
    }, 0)
  }
})

let time = 0, addition = .5

for (i = 0; i < infoEvents.querySelectorAll('*').length; i++) {
  if (!infoEvents.querySelectorAll('*')[i].classList.contains('event-title') || infoEvents.querySelectorAll('*')[i].tagName !== 'A') {
    animation(i)
  }
}

function animation(index) {
  setTimeout(() => {
    infoEvents.querySelectorAll('*')[index].style.opacity = '1'
  }, time)
  time+=addition
}

setTimeout(() => {
  scrollTo(0, scrollY - window.screen.height / 5)
}, 50)

setTimeout(() => {
  window.onscroll = () => {
    if (scrollY < themePositions[index - 1] && index > 1) {
      clearOpacityLeftNav()
      index--
      eventNavThemes[index - 1].style.opacity = '1'
    }
    
    if (scrollY >= themePositions[index]) {
      clearOpacityLeftNav()
      eventNavThemes[index].style.opacity = '1'
      index++
    }
  }
}, 100)